<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of DBeaver Community and creates a package.</string>
	<key>Identifier</key>
	<string>leniolabs.pkg.DBeaverCommunity</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>DBeaver</string>
		<key>BUNDLE_ID</key>
		<string>org.jkiss.dbeaver.core.product</string>
		<key>NAME</key>
		<string>DBeaver Community</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>leniolabs.download.DBeaverCommunity</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
