<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Cisco Webex Meetings.</string>
	<key>Identifier</key>
	<string>leniolabs.download.Cisco Webex Meetings</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://akamaicdn.webex.com/client/webexapp.dmg</string>
		<key>NAME</key>
		<string>Cisco Webex Meetings</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>webexapp.dmg</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Cisco Webex Meetings.pkg</string>
				<key>requirement</key>
				<string>identifier "com.cisco.webex.Cisco Webex Meetings"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
        <key>Processor</key>
        <string>FlatPkgUnpacker</string>
        <key>Arguments</key>
        <dict>
            <key>flat_pkg_path</key>
            <string>%pathname%/Cisco Webex Meetings.pkg</string>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/pkg_unpack</string>
            <key>purge_destination</key>
            <true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
				<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/application_payload/</string>
				<key>pkgdirs</key>
				<dict/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/pkg_unpack/Payload</string>
				<key>destination_path</key>
				<string>%pkgroot%</string>
				<key>purge_destination</key>
				<false/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%destination_path%Applications/Meeting Center/Contents/Helpers/webexmta.app/Contents/Info.plist</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
